In [4]:
import numpy as np
import pandas as pd
from sklearn.tree import DecisionTreeClassifier

In [29]:
df = pd.read_csv("data/titanic.csv", index_col="PassengerId")

In [10]:
df[:10]

             Survived  Pclass  ... Cabin Embarked
PassengerId                    ...
1                   0       3  ...   NaN        S
2                   1       1  ...   C85        C
3                   1       3  ...   NaN        S
4                   1       1  ...  C123        S
5                   0       3  ...   NaN        S
6                   0       3  ...   NaN        Q
7                   0       1  ...   E46        S
8                   0       3  ...   NaN        S
9                   1       3  ...   NaN        S
10                  1       2  ...   NaN        C

[10 rows x 11 columns]

In [31]:
df = df[["Pclass", "Fare", "Age", "Sex", "Survived"]]
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    891 non-null    int64
 1   Fare      891 non-null    float64
 2   Age       714 non-null    float64
 3   Sex       891 non-null    object
 4   Survived  891 non-null    int64
dtypes: float64(2), int64(2), object(1)
memory usage: 41.8+ KB

In [32]:
df["Sex"] = df["Sex"].astype("category")
df["Sex"] = df["Sex"].cat.codes
df[:10]

             Pclass     Fare   Age  Sex  Survived
PassengerId
1                 3   7.2500  22.0    1         0
2                 1  71.2833  38.0    0         1
3                 3   7.9250  26.0    0         1
4                 1  53.1000  35.0    0         1
5                 3   8.0500  35.0    1         0
6                 3   8.4583   NaN    1         0
7                 1  51.8625  54.0    1         0
8                 3  21.0750   2.0    1         0
9                 3  11.1333  27.0    0         1
10                2  30.0708  14.0    0         1

In [33]:
df = df.dropna()

In [35]:
xcols = ["Pclass", "Fare", "Age", "Sex"]
ycol = ["Survived"]

clf = DecisionTreeClassifier(random_state=241)
clf.fit(df[xcols], df[ycol])

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=241, splitter='best')

In [50]:
features

[('Fare', 0.3034364695314525),
 ('Sex', 0.30051221095823943),
 ('Age', 0.2560461009790662),
 ('Pclass', 0.1400052185312419)]

In [49]:
importances = clf.feature_importances_
features = sorted(zip(xcols, importances), key=lambda t: -t[1])
best_features = map(lambda x: x[0], features[:2])

In [51]:
with open("submission_1", "w") as f:
    f.write(" ".join(list(best_features)))
f.close()